Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: My English teacher advised me to read these books.
jbo: lo glico ctuca be mi ba'o stidi lo nu mi tcidu loi vi cukta

source: My house is north of the city.
jbo: lo mi zdadi'u cu berti lo tcadu

source: My home town is adjacent to the ocean.
jbo: le mi tcadu cu lamji le xamsi

source: My brother lives in a small village.
jbo: lo mi bruna cu xabju lo cmalu cmatca

source: My brother is now in Australia.
jbo: lo bruna be mi ca zvati la Australias

source: My brother can drive a car.
jbo: lo mi bruna cu kakne lo nu klasazri lo karce

source: My favorite sport is soccer.
jbo: nelrai be mi esporte fa lo fudbolo

source: Seeing me, they suddenly stopped talking.
jbo: mu'i lo nu viska mi kei ra suksa co'urtavla

source: My children really like animals.
jbo: lo me mi verba ku je'a nelci lo danlu

source: My watch is more accurate than yours.
jbo: lo mi junla cu zmadu lo do co'e lo ka satci

source: Something is wrong with my watch.
jbo: lo mi kanjunla cu spofu

source: Something has happened to my car.
jbo: tu'a lo mi karce cu fasnu

source: My uncle is the manager of this hotel.
jbo: lo famti be mi cu jitro lo vi xotli

source: My uncle never writes letters.
jbo: lo famti be mi no roi ciska lo xatra

source: My goal in life is to be Prime Minister.
jbo: lo terzu'e pe lo nu mi jmive cu du'u mi truralju

source: My seat is near the door.
jbo: le mi stizu cu jibni le vorme

source: My brother speaks very fast.
jbo: lo mi bruna cu sutra tavla

source: My father is a doctor.
jbo: lo patfu be mi cu mikce

source: My father is a great traveler.
jbo: lo patfu be mi cu banli litru

source: My mother doesn't like watching TV.
jbo: lo mi mamta na nelci lo nu zgana lo veltivni

source: My mother seldom watches TV at night.
jbo: le mi mamta piso'uroi catlu lo tivni ca lo nicte

source: My sister is famous.
jbo: lo mensi be mi ku misno

source: My dream is to become a teacher.
jbo: pacna fa mi lo nu ctuca

source: My name is Yamada.
jbo: mi'e .iamada.

source: The man who lives next door to me is a doctor.
jbo: lo nanmu poi xabju lamji mi cu mikce

source: I studied English when I was there.
jbo: ca lo nu zvati ra kei mi tadni lo glibau

source: I have to find it.
jbo: mi nitcu lo nu facki fi ra

source: I'm very tired.
jbo: mi mutce tatpi

source: I am a student.
jbo: mi tadni

source: My name is Hisashi.
jbo: mi'e xisacis.

source: I was born in Osaka in 1977.
jbo: mi jbena bu'u la osakan ca li pasozeze

source: I had a bad cold for a week.
jbo: le nu mi xlali bilma la zukAm. cu jeftu

source: I have memorized 2000 English words.
jbo: mo'u mo'icli fi su'o reki'o lo valsi befi lo glico

source: I came to Japan four years ago intending to stay for one year.
jbo: mi pu klama to'o la nipon za lo nanca be li vo semu'i lo ka stali ze'a lo nanca be li pa

source: I arrived here about five o'clock.
jbo: mi mo'u klama ti ti'u li mu

source: I must say no to you.
jbo: ie nai ei

source: I want to see your mother.
jbo: .au mi viska lo mamta be do

source: I do not understand you.
jbo: mi na jimpe fi do

source: I know some students in that school.
jbo: mi selsau so'o tadni pe le ckule

source: I have been to America twice.
jbo: mi re roi zvati lo mergu'e

source: He wants to go to America.
jbo: ra djica lo nu klama lo mergu'e

source: I am an American.
jbo: mi merko

source: I have a nice camera.
jbo: mi ralte lo melbi kacma

source: I have a big dog.
jbo: mi ponse lo barda gerku

source: I want to be a pilot when I grow up.
jbo: mi djica lo ka vinji sazri fau lo ka makcu

source: I ordered two teas and three coffees.
jbo: mi pu cpedu re tcati .e ci ckafi

source: I have once been to Europe.
jbo: mi pu paroi zvati lo ropno

source: I once lived in Rome.
jbo: mi ca da xabju la.rom.

source: I lost my camera.
jbo: mi cirko lo mi kacma

source: I have been living here for three years.
jbo: mi ti ca'o xabju co'a pu za lo nanca be li ci

source: I am not liked by this dog.
jbo: mi na se nelci ti poi gerku

source: I like the arrangement of the furniture in this room.
jbo: .i mi nelci loi te ganzu be lo ti nilce

source: I bought this book yesterday.
jbo: mi te vecnu lo vi cukta ca lo prulamdei

source: I have a computer.
jbo: mi ralte lo skami

source: I don't want any sandwiches.
jbo: mi djica tu'a no snuji

source: I know a little about Shakespeare.
jbo: mi toltce djuno fi la .ceikspir.

source: I must have lost my purse in the supermarket.
jbo: ja'o mi pu cirko le mi dinvau

source: I am already prepared.
jbo: mi ca'o bredi

source: I don't go in for sports.
jbo: mi na xadgu'a

source: I felt for the poor dog.
jbo: mi cinmo fi tu'a le gerku

source: I could not sleep because of the noise.
jbo: ri'a tu'a lo savru mi pu na kakne lo nu sipna

source: I favored the hypothesis.
jbo: mi pu zanru lo se pesti'i

source: I saw the man jump.
jbo: mi pu viska lo nu lo nanmu ku plipe

source: I have no wish to see the man again.
jbo: mi nova'e djica lo ka viska le nanmu za'ure'u

source: I'll keep the matter in mind.
jbo: mi ba pensi lo se preti

source: I will do it myself.
jbo: .e'ese'a

source: I'm glad to hear that.
jbo: .ui mi tirna ta

source: I like chocolate.
jbo: mi nelci lo cakla

source: I hid under the table.
jbo: mi vo'a mipri ni'a lo jubme

source: I'll get in touch with you as soon as possible.
jbo: .i mi do tavla ca lo pare'u ba nunka'e

source: Where am I?
jbo: mi zvati ma

source: I like both.
jbo: mi nelci re ro zo'e

source: I'm lonely.
jbo: mi nonkansa

source: I want to see her very much.
jbo: mi djica lo ka viska ra i taibo mutce

source: I got very tired but I felt good.
jbo: mi puki co'a mutce tatpi .i ku'i mi kufra

source: I regarded Tom as a friend.
jbo: mi pu jinvi lo du'u la tom mi pendo

source: I want a Toyota.
jbo: mi djica lo me la.toiotas.

source: I have a cat and a dog. The cat is black and the dog is white.
jbo: mi ralte lo mlatu e lo gerku .i my xekri .i je gy blabi

source: I'm waiting for the bus.
jbo: mi denpa tu'a lo sorprekarce

source: I played football.
jbo: mi pu kelci lo fudbolo

source: I want to study French.
jbo: mi djica lo nu tadni lo fasybau

source: I'm going to read some other books.
jbo: mi platu fi lo nu tcidu so'o drata cukta

source: I take a bath almost every day.
jbo: mi mi lumci ca so'a djedi

source: I have broken my glasses.
jbo: .i mi jai jai ri'a se porpi lo mi kalyle'otci

source: I was surprised to see a lion.
jbo: mi pu se spaji lonu mi viska lo cinfo

source: I love rock.
jbo: mi nelci la'o gy. Rock .gy.

source: I'd like to go to London.
jbo: mi djica lo nu ba klama la'oi London

source: I caught sight of Namie Amuro.
jbo: mi pu co'a viska la nami,es.amuros.

source: I used to take a walk every morning.
jbo: mi ba'o dzuli'u ca ro cerni

source: I have met him before.
jbo: .i mi lo prenu su'oroi penmi

source: I was compelled to do this against my will.
jbo: .i mi jai se bapli fai lo na se djica

source: I regret not having taken my doctor's advice.
jbo: mi xenru lo ka na pu tinbe lo se stidi be lo pe mi mikce

source: I bought a book.
jbo: mi pu te vecnu lo cukta

source: I looked for the book for an hour.
jbo: mi pu sisku tu'a le cukta ze'a lo cacra

source: I am an only child.
jbo: mi pa mei cifnu

source: I have one brother.
jbo: mi se bruna pa da

source: I always keep my promises.
jbo: mi roroi gasnu lo se nupre be mi

source: I was lucky.
jbo: zabna funca mi

source: I want to learn how to swim.
jbo: mi djica lo ka ka'erbi'o lo ka limna

source: I like studying English.
jbo: mi nelci lo nu tadni lo glibau

source: I have some English books.
jbo: mi ralte so'o lo glico cukta

source: I can read English, but I can't speak it.
jbo: mi jimpe tcidu lo glico i ku'i mi kakne nai lo ka tavla ri

source: I bumped into him at the station.
jbo: bu'u lo tcana mi penmi ra

source: I met an old man near the station.
jbo: mi lo tolci'o nanmu cu penmi vi le renytcana

source: I met her in a coffee shop near the station.
jbo: mi ko'a penmi lo kafyzai be vi le renytcana

source: I'm just about to set off for the station.
jbo: mi bazi cliva seka'a lo renytcana

source: I went to the station.
jbo: mi klama le renytcana

source: I met my teacher on the way to the station.
jbo: mi lo mi ctuca se penmi ca'o klama le renytcana

source: I took a cab to the station.
jbo: mi lo renytcana cu klama fu lo sefkarce

source: I played an important part in the garden party.
jbo: mi vajni le purdi tersla

source: I belong to the drama club.
jbo: mi le dracybende cu cmima

source: I am interested in music.
jbo: lo zgike cu cinri mi

source: I want to drink something.
jbo: mi djica lo nu pinxe da

source: I can't do anything.
jbo: mi na kakne lo ka zukte da

source: I am in the house.
jbo: mi nenri lo zdani

source: I'm going to sell my house.
jbo: mi ba vecnu lo zdani be mi

source: I go to school because I want to learn.
jbo: mi ve ckule mu'i lo nu mi kaidji lo ka cilre

source: I feel happiest when I am in school.
jbo: mi cinmo lo ka traji gleki kei lo nu mi zvati lo ckule

source: I am very sensitive to the cold.
jbo: mi mutce ganse lo ka lenku

source: I am happy to help you.
jbo: mi gleki lo nu sidju do

source: I felt rather puzzled.
jbo: .i mi je'a se cfipu

source: I was born in Kyoto.
jbo: mi jbena fo la.kioton.

source: I'm a teacher.
jbo: mi ctuca

source: I'm a bank clerk.
jbo: mi banxa gunka

source: I met a friend of mine at the airport.
jbo: mi pu penmi lo pendo be mi le vijytcana

source: I met her by accident at the bus stop.
jbo: mi snuti penmi ra bu'u lo tcana be lo sorprekarce

source: I know your brother very well.
jbo: mi djuno fi lo do bruna

source: I like your car.
jbo: mi nelci lo do karce

source: I need your help.
jbo: be'u do sidju mi

source: I'm married.
jbo: mi se speni da

source: I asked Ken to help me.
jbo: mi pu cpedu lo nu la .ken. sidju mi

source: I have a dog and two cats.
jbo: mi ralte pa gerku e re mlatu

source: I have lost the key.
jbo: mi pu cirko lo ckiku

source: I'm fine.
jbo: .uicu'i

source: I felt lonely.
jbo: mi pu cinmo lo ka nonkansa

source: I like going for a walk in the park.
jbo: mi nelci lo nu cadzu lo panka

source: I feel happy.
jbo: mi cinmo lo ka gleki

source: I'm at the airport now.
jbo: mi ca zvati lo vijytcana

source: I am writing a letter.
jbo: mi ca ciska lo xatra

source: I just arrived now.
jbo: mi cazi klamu'o

source: I went to church this morning.
jbo: mi klama lo xismalsi ca le cabycerni

source: I am going out this afternoon.
jbo: mi cliva ca lo zi lecydo'i

source: I'm free today.
jbo: mi zifre ca lo cabdei

source: I received a letter written in English yesterday.
jbo: mi terbe'i lo xatra be bau la glibau ca le prulamdei

source: I attended the meeting yesterday.
jbo: mi pu zvati lo nu penmi de'i li vu'u pa

source: I went to the park yesterday.
jbo: ca lo prulamdei mi klama lo panka

source: I arrived in Tokyo yesterday.
jbo: mi mulkla la.tokion. ca lo prulamdei

source: I helped him yesterday.
jbo: ca lo prulamdei mi sidju ra

source: I helped my father yesterday.
jbo: mi sidju lo mi patfu de'i li vu'u pa

source: I didn't need to take an umbrella with me.
jbo: mi na pu nitcu lo ka lebna lo santa sei ri mi ja'e kansa

source: I did the whole of the work by myself.
jbo: mi pu zukte pi roda si'anai

source: I bought the book which the children need.
jbo: mi terve'u lo cukta poi seltcu lei verba

source: I know it for a fact.
jbo: mi ja'a djuno la'e di'u

source: I made the fact known to all my friends.
jbo: mi jungau ro lo pendo be mi lo fatci

source: I want to have my own room.
jbo: .au mi pamei xabju lo kumfa

source: He is proud of his son.
jbo: ko'a jgira tu'a lo bersa be ko'a

source: I go to church by car.
jbo: mi klama lo malsi fu lo karce

source: I do not know how to drive a car.
jbo: mi na kakne lo ka sazri lo karce

source: I don't have a car.
jbo: mi ralte no karce

source: I decided to buy a car.
jbo: mi jdice lo nu terve'u lo karce

source: I wrote a letter.
jbo: mi pu ciska lo xatra

source: I'm writing a letter.
jbo: mi ca ciska lo xatra

source: I was relieved to know that the operation was a success.
jbo: ua o'u lo cuntu cu se snada

source: I'm going to Paris in the fall.
jbo: mi klama la paris ca lo critu

source: As for me, I don't want to go out.
jbo: mi zo'u .aunai bartu cadzu

source: I couldn't sleep because of the heat.
jbo: mi na pu sipna ki'u lenu glare

source: I am looking for an assistant.
jbo: mi sisku lo sidju

source: I have a few books.
jbo: mi ralte so'u lo cukta

source: I don't want to be laughed at.
jbo: .au na mi'afra mi

source: I am a new student.
jbo: mi cnino tadni

source: I know the truth.
jbo: mi djuno zo'ei lo jetnu

source: I have read every book in the library.
jbo: mi ba'o tcidu rolo cukta po le ckudi'u

source: I hope to get away from Tokyo for a few days.
jbo: .a'o mi bartu la .tokios. ze'a su'oso'u djedi

source: I am interested in old cities in the world.
jbo: mi kucli lo cirsau tcadu pe piro le terdi

source: I'm not a student.
jbo: mi na selctu

source: I bought a red sports car.
jbo: mi pu te vecnu lo xunre ke esporte karce

source: I like red roses.
jbo: mi nelci lo xunre rozgu

source: I have a new red car.
jbo: mi ralte lo xunre cnino karce

source: I've lost my ticket.
jbo: mi pu cirko lo mi pikta

source: I tried my best, only to fail again.
jbo: mi traji troci gi'e ku'i fliba za'u re'u

source: I run.
jbo: mi bajra

source: I do run.
jbo: mi ja'a bajra

source: I was hurt by many people.
jbo: so'i prenu mi jai xrani

source: I'm healthy.
jbo: mi kanro

source: I have a big black dog.
jbo: mi ralte lo barda xekri gerku

source: Who am I?
jbo: mi'e ma

source: I like short poems.
jbo: mi nelci lo tordu pemci

source: I came to Japan from China.
jbo: mi pu klama la nipon la djunguos

source: I couldn't control my anger.
jbo: .i mi pu kamfe'u sezytro zifre naku

source: I live at Akasaka in Tokyo.
jbo: mi se zdani la akasakas poi se stuzi la tokios

source: I have two books.
jbo: mi ralte re lo cukta

source: I'm leaving on Sunday.
jbo: mi ba cliva ca lo nondei

source: I do not like cats and my brother does not either.
jbo: mi na nelci lo mlatu soi vo'a lo bruna be mi

source: I do not have a cat.
jbo: mi na ralte lo mlatu

source: I'm only a customer.
jbo: .i mi te vecnu po'o

source: I was not aware of his presence.
jbo: mi na'e pu sanji lo nu ra zvati

source: I think he did it.
jbo: ru'a ko'a pu gasnu ra

source: I expect him to help me.
jbo: mi kanpe lo nu ra sidju mi

source: I visited the village where he was born.
jbo: mi vitke zi'o lo cmatca poi ve jbena fo ra

source: I was angry because he was late.
jbo: .i mi pu fengu lo nu lerci

source: I am to have lunch with him.
jbo: mi .ai joi ko'a cu ba citka lo dormijysai

source: I made him open the door.
jbo: mi gasnu lo nu ra kargau lo vorme

source: I asked him to help me.
jbo: mi cpedu fi ko'a fe lo nu sidju mi

source: I like his music.
jbo: mi nelci lo ra zgike

source: I tried to listen to him carefully.
jbo: mi pu troci lo nu tinju'i ko'a

source: I know his address.
jbo: mi djuno tu'a lo me ta judri

source: I have nothing to do with them.
jbo: mi to'e srana ko'a

source: I saw her swim.
jbo: mi pu viska lo nu ko'a limna

source: I don't like her.
jbo: mi na nelci ra

source: I informed him of her arrival.
jbo: mi pu gasnu lo nu ko'a djuno lo du'u ko'e tolcliva

source: I want to talk to her.
jbo: .au mi ko'a tavla

source: I hope that I'll see her.
jbo: mi pacna lo nu mi ba viska ra

source: I love her.
jbo: mi prami ra

source: I don't love her.
jbo: mi na prami ra

source: I like stories that have sad endings.
jbo: mi nelci lo lisri poi badri se fanmo

source: I was very tired.
jbo: mi pu mutce tatpi

source: I saw a beautiful bird.
jbo: mi viska lo melbi cipni

source: I am a lover of the beautiful.
jbo: mi prami lo melbi

source: I am deeply interested in art.
jbo: .a'ucai lardai

source: I will call you without fail.
jbo: mi ba fonta'a ju'ocai do

source: I will lose weight.
jbo: mi ba planyjdika

source: Illness prevented me from going to school.
jbo: lo nu bilma cu fanta lo nu mi klama lo ckule

source: I'm poor.
jbo: mi pindi

source: I dreamed a strange dream.
jbo: mi senva lo cizra se senva

source: I usually have a light breakfast.
jbo: mi so'eroi citka lo cmalu cersai

source: I usually go to bed at nine.
jbo: mi so'e roi klama lo ckana ti'u li repa

source: I introduced my father to the teacher.
jbo: mi pengau lo mi patfa lo tcidu

source: I don't have to clean my room.
jbo: einai mi mulci lo kumfa pe mi

source: I live in Hyogo.
jbo: mi se zdani la xiogos

source: I went to Disneyland with my mother.
jbo: mi joi le mi mamtu la .dIsniland. klama

source: I had all my clothes washed by my mother.
jbo: gau mi le mi mamta cu lumci loi mi ro taxfu

source: I love, and will continue to love, my mother country.
jbo: mi caca'o je baca'o prami le mi krasi gugde

source: I often play soccer after school.
jbo: mi cafne kelci lo fudbolo ba tu'a lo ckule

source: I'm busy.
jbo: mi tolcando

source: I'm too busy to help him.
jbo: mi dukse lo ka se cuntu kei lo nu sidju ko'a

source: I was reading a book.
jbo: mi pu tcidu fi lo cukta

source: I do not have a sister.
jbo: no da mensi mi

source: I gave my sister a dictionary.
jbo: mi pu dunda lo vlacku lo mi mensi

source: I visit my parents every Sunday without fail.
jbo: .i mi prane lo ka vitke lo rirni ca ro lo zeldei

source: I catch the flu every year.
jbo: lo nu mi bilma la .influ,enzas. kei cisti

source: I have a daughter.
jbo: mi se tixnu

source: I'll come back.
jbo: mi ba se'ixru

source: I'm afraid of wild animals.
jbo: mi terpa tu'a lo cilce danlu

source: I regret not having kept my promise.
jbo: .u'u mi mo'u na gasnu lo mi se nupre

source: I felt sad for no reason.
jbo: mi pu badri zi'o

source: I have my supper at a quarter past seven.
jbo: mi citka lo ctesai ti'u li paso pi'e pamu

source: I like traveling.
jbo: mi nelci lo nu mi litru

source: I talked with my parents about my studying abroad.
jbo: mi pu tavla lo mi rirni lo nu mi tadni bu'u lo bartu gugde

source: I like studying history.
jbo: mi nelci lo nu tadni lo citri

source: I went to Boston by train.
jbo: mi pu klama la.bastn. fu lo trene

source: I also went.
jbo: mi ji'a pu klama

source: It is very kind of you to help me.
jbo: do mutce lo ka xendo be mi bei lo ka sidju mi

source: I myself did it.
jbo: mi co'i si'anai zukte

source: Many of us were tired.
jbo: so'i mi'a pu tatpi

source: We enjoyed ourselves at the seaside.
jbo: mi'o pukfri lo nu zvati le xaskoi

source: We tend to use English when we see a foreigner.
jbo: sei lakne mi'ai tavla lo fange bau lo glico

source: I study English at school.
jbo: mi tadni lo glibau bu'u lo ckule

source: We seek happiness.
jbo: mi'a sisku lo ka gleki

source: We are distinct from each other in taste.
jbo: .i lu'i lo'e prenu cu ficysi'u lo ka ce'u se pluka makau

source: We enjoyed a long voyage across the Pacific Ocean.
jbo: .i mi'a selpu'a lo nu ze'u litru la pasifik poi braxamsi

source: We went to the park to play.
jbo: mi'a klama lo panka mu'i lo nu kelci

source: Paper burns quickly.
jbo: lo papri cu sutra jelca

source: I have to prepare for the test.
jbo: .ei mi bregau mi lo cipra

source: The game will be held even if it rains.
jbo: gu ci'erkei gi carvi

source: On account of an accident, I was late for school.
jbo: ki'u tu'a lo snuti lo nu mi klama lo ckule cu lerci

source: The office has been transferred up to the sixth floor.
jbo: le briju cu pu muvdu le xamoi dijysenta

source: My watch is broken, so I want a new one.
jbo: le mi junla cu mo'u porpi ja'e lonu mi po'edji lo cnino junla

source: Do you have a timetable?
jbo: xu do ralte lo tcika cartu

source: A notice about the next meeting was posted on the door.
jbo: lo notci be lo se lidne nunpe'i cu se punji fi lo vrogai

source: Jiro wants to drink Coke.
jbo: la'oi Jiro djica lo ka pinxe la'oi Coke

source: You've told me something.
jbo: do pu jungau mi

source: Nature plays an important role in our life.
jbo: lo rarna munje ku vajni ca lo nu ma'a se lifri

source: I bike to work.
jbo: mi ta'e relxilma'ekla lo briju be mi

source: I don't have a bicycle.
jbo: mi ralte no relxilma'e

source: Do good to those who hate you.
jbo: ko zukte lo xamgu be da poi xebni do

source: What if I fail?
jbo: mo va'o lo nu mi fliba

source: The fact is I do not love her.
jbo: sei fatci mi na prami ta poi fetsi

source: As a matter of fact, I dislike him.
jbo: da'inai mi to'e nelci ra

source: The results of the experiment were not as we had hoped.
jbo: mi na pacna lodu'u makau se jalge lo cipra

source: The experiment was successful.
jbo: lo cipra pu snada

source: I lie on the grass.
jbo: mi vreta lo srasu

source: Young people tend to think so.
jbo: sei lakne lo ctino ku jinvi da bi'unai

source: Young people like his books.
jbo: lo citno prenu cu nelci lo ko'a cukta

source: Help me.
jbo: ko sidju mi

source: Let's have a drink or something.
jbo: e'u pinxe gija zukte lo simsa

source: Drink less and sleep more.
jbo: ko mleca pinxe gi'e zmadu sipna

source: Do you like sushi?
jbo: xu do nelci lo rismrsuci

source: I talk in my sleep very often.
jbo: mi so'isairoi tavla fau lo nu mi sipna

source: The autumn sky is clear and serene.
jbo: le critu tsani cu klina secau lo dilnu

source: Fall is the best season for sports.
jbo: lo critu cu pamoi fi tu'a loi xadykelci'e

source: Practice makes perfect.
jbo: lo nu rapli cu nibli lo nu co'a certu

source: The boat is lost.
jbo: le bloti co'i se cirko

source: It was time to leave.
jbo: pu tcika lo nu cliva

source: Something has to be done to stop the bleeding.
jbo: ja'o lo nu sisti lo nu blucri cu seltcu selgau

source: There was no objection on the part of those present.
jbo: lo vi remna cu na darlu fi ko'a

source: Which do you like better, spring or autumn?
jbo: do zmadu nelci lo vensa ji lo critu

source: Aren't you ready?
jbo: naipei do bredi

source: He could not sleep because of the heat.
jbo: pu na sipna ri'a lo du'u glare

source: Woman as she was, she was brave.
jbo: ko'a nanmu jeku'i virnu

source: Your business is flourishing, I hear.
jbo: ti'e lo do gunka cuntu cu banro

source: Is Mr Ozawa going to be the next manager?
jbo: xu la nan.oza,uas. cu termu'i lo ka binxo lo ba jatna

source: Flour is made from wheat.
jbo: lo grupu'o cu se zbasu fi lo maxri

source: Seen at a distance, the rock looks like a squatting human figure.
jbo: le rokci cu smimlu lo remna poi demtse ku fo lo darno

source: The boy clasped the puppy to his chest.
jbo: lo nanla cu jgari lo verba gerku fo lo cutne

source: The boy came running into the room.
jbo: lo nanla pu bajra mo'i ne'i lo kumfa

source: Laugh and be fat.
jbo: ko cmila gi'e plana

source: An elephant has a long nose.
jbo: lo xanto cu se ke clani nazbi

source: Do I have to change trains?
jbo: eipei lo trene cu se basti

source: Everything is against us.
jbo: roda fapro ma'a

source: It was not until the child was fed that he stopped crying.
jbo: lo verba ba lo nu vo'a citka cu co'u klaku

source: It's unbelievable.
jbo: na krici kakne

source: The signal was red.
jbo: lo sinxa pu xunre

source: I like sleeping.
jbo: mi nelci lo nu mi sipna

source: The judge's decision is final.
jbo: lo lo pajni ku se jdice cu mulno

source: I have a new pen; I'll lend it to you.
jbo: mi ponse lo cnino penbi .i mi ba te jbera ri do

source: I am working on my new book.
jbo: mi ca'o finti lo cnino cukta

source: I'm sorry, we have no vacancies.
jbo: .u'u no da zifre kumfa tu'a mi

source: God created the world.
jbo: lo cevni pu finti lo munje

source: God is.
jbo: pa cevni ku zasti

source: God redeemed them from sin.
jbo: le cevni mo'u nurxru ko'a lo jdazei

source: Love your parents as dearly as your parents love you.
jbo: loni ko prami le rirni cu dirba simsa loni ri prami do

source: The honor you are giving me is more than I deserve.
jbo: .i lo ni mi se sinma poi do jarco cu zmadu lo je'a se jerna
